# ResetTextPosition Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Dimension..::..ResetTextPosition Method
Dimension Class See Also
---
Resets the text position of the dimension to the initial position determined by its type and parameters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void ResetTextPosition()
```

Visual Basic
---
```text
Public Sub ResetTextPosition
```

Visual C++
---
```text
public:
void ResetTextPosition()
```

# Remarks
The initial point is the text position determined by the type and parameters of the dimension. This property is for use with single-segment dimensions only. For multi-segment dimensions use the corresponding method of the DimensionSegment class.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when: |

  * SpotDimension has more than one segments.

# See Also
Dimension Class
Autodesk.Revit.DB Namespace